Revit 2024 API
WireMaterialType.TemperatureRatings Property
 Get all temperature rating type definitions defined in this wire material type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public TemperatureRatingTypeSet TemperatureRatings { get; }
Visual Basic
Public ReadOnly Property TemperatureRatings As TemperatureRatingTypeSet
	Get
Visual C++
public:
property TemperatureRatingTypeSet^ TemperatureRatings {
	TemperatureRatingTypeSet^ get ();
}
See Also
WireMaterialType Class
Autodesk.Revit.DB.Electrical Namespace